Revit 2027 API
View.CanEnableTemporaryViewPropertiesMode Method
 Indicates if Temporary View Properties mode can be applied for view in current state.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanEnableTemporaryViewPropertiesMode()
Public Function CanEnableTemporaryViewPropertiesMode As Boolean
public:
bool CanEnableTemporaryViewPropertiesMode()
member CanEnableTemporaryViewPropertiesMode : unit -> bool
Return Value
Boolean
 True if view can use Temporary View Properties mode in current state.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace